app/controllers/users_controller.rb

  def create
    @user =  User.new(mail_address: params[:mail_address])
    if @user.save
---
INSERT INTO `users` (`mail_address`, `created_at`, `updated_at`) VALUES ('coding_addiction@yahoo.co.jp', '2019-09-08 02:28:15', '2019-09-08 02:28:15')

  def delete
    @user = User.find_by(mail_address: params[:mail_address])
---
SELECT  `users`.* FROM `users` WHERE `users`.`mail_address` = '' LIMIT 1

  def delete_from_index
    @user = User.find_by(id: params[:id])
    if @user
      @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 1

  def send_instant
    unless set_send_flag
      @users = User.all
      render('users/index')
      return
    end

    @user = User.find_by(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1