app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user =  User.new(mail_address: params[:mail_address])
    if @user.save
---
INSERT INTO `users` (`mail_address`, `created_at`, `updated_at`) VALUES ('killerpass0111@gmail.com', '2019-09-03 09:59:00', '2019-09-03 09:59:00')

  def delete
    @user = User.find_by(mail_address: params[:mail_address])
    if @user
      @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`mail_address` = '' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def delete_from_index
    @user = User.find_by(id: params[:id])
    if @user
      @user.destroy
      flash[:notice] = "#{@user.mail_address}を削除しました"
    elsif params[:mail_address] == ""
      flash[:notice] = "メールアドレスが入力されていません"
    else
      flash[:notice] = "存在しないメールアドレスです"
    end

    @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
SELECT `users`.* FROM `users`

  def send_instant
    unless set_dend_flag
      @users = User.all
      render('users/index')
      return
    end

    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def send_album_mail
    if set_dend_flag
      @users = User.all

      @users.each do |user|
---
SELECT `users`.* FROM `users`